identification division.
program-id.  CobolCallingJava.
data division.
working-storage section.
       COPY "../def/java.def".

01 LOGMSG 		PIC X(256).
01 STATUS-VAL 		PIC S9(02) VALUE ZERO.
01 FIELD-INT		USAGE IS SIGNED-INT.			
01 FIELD-RET		USAGE IS SIGNED-INT.			
01 FIELD-BOOL		pic 9.			
01 FIELD-BOOLRET	pic 9.			
01 FIELD-BYTE		pic x.			
01 FIELD-BYTERET	pic x.			
01 FIELD-CHAR		pic x.			
01 FIELD-CHARRET	pic x.			
01 FIELD-SHORT		USAGE IS SIGNED-SHORT.			
01 FIELD-SHORTRET	USAGE IS SIGNED-SHORT.			
01 FIELD-LONG		PIC S9(18) COMP-5.			
01 FIELD-LONGRET	PIC S9(18) COMP-5.			
01 FIELD-FLOAT		USAGE IS FLOAT.			
01 FIELD-FLOATRET	USAGE IS FLOAT.			
01 FIELD-DOUBLE		USAGE IS DOUBLE.			
01 FIELD-DOUBLERET	USAGE IS DOUBLE.			
01 FIELD-STRING		PIC X(80).			
01 FIELD-STRINGRET	PIC X(256).			
01 OBJECT-HANDLE	USAGE HANDLE.			
01 ARRAY-HANDLE		USAGE HANDLE.			
01 ARRAY-SIZE		USAGE IS SIGNED-INT VALUE 10.			
01 OBJ-HANDLE-ARR	USAGE HANDLE occurs 10.			
01 STRING-TABLE		PIC X(20) occurs 10.			
01 INT-TABLE		USAGE IS SIGNED-INT occurs 10.
01 INT-GROUP.
    03  INT-DATA occurs 10 times.
        05  INT-ELEMENT signed-int.


linkage section.
77  string-in-out	pic x(256) value spaces.
77  int-in-out		USAGE IS SIGNED-INT.			
77  byte-in-out		pic x.			
77  char-in-out		pic x.			
77  boolean-in-out	pic 9.			
77  short-in-out	USAGE IS SIGNED-SHORT.			
77  long-in-out		USAGE IS SIGNED-LONG.			
77  float-in-out	USAGE IS FLOAT.			
77  double-in-out	USAGE IS DOUBLE.			

procedure division using string-in-out, int-in-out, byte-in-out,
	char-in-out, boolean-in-out, short-in-out, long-in-out,
	float-in-out, double-in-out.
main-logic.

*          .ArrayTest.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, " ".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "******************************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "** Array Test ****************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "******************************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "******************************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, " ".
	   
*          .IntArrayTest.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "Int Array Test".
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "()V" GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CREATEARRAY, CJAVA-INTARRAY, ARRAY-SIZE GIVING ARRAY-HANDLE.
	   
	   MOVE 1111 to INT-TABLE(1)
	   MOVE 2222 to INT-TABLE(2)
	   MOVE 3333 to INT-TABLE(3)
	   MOVE 4444 to INT-TABLE(4)
	   MOVE 5555 to INT-TABLE(5)
	   
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 1, INT-TABLE(1), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 2, INT-TABLE(2), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 3, INT-TABLE(3), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 4, INT-TABLE(4), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 5, INT-TABLE(5), GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 5, INT-TABLE(1), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 4, INT-TABLE(2), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 3, INT-TABLE(3), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 2, INT-TABLE(4), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 1, INT-TABLE(5), GIVING STATUS-VAL.
	   
*	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava",
*	   	"CobolCallingJavaIntArray", "([I)I", ARRAY-HANDLE, FIELD-RET GIVING STATUS-VAL
	   	
	   MOVE 0000 to INT-TABLE(1)
	   MOVE 0000 to INT-TABLE(2)
	   MOVE 0000 to INT-TABLE(3)
	   MOVE 0000 to INT-TABLE(4)
	   MOVE 0000 to INT-TABLE(5)
	   
*	   CALL "C$JAVA" USING CJAVA-CONVERTARRAYTOTABLE, ARRAY-HANDLE, TABLE-SIZE, ELEM-SIZE, TABLE-NAME(1) GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-CONVERTARRAYTOTABLE, ARRAY_HANDLE, 10, 0, INT-TABLE(1) GIVING STATUS-VAL.
	   
	   MOVE 9999 to INT-TABLE(1)
	   MOVE 9999 to INT-TABLE(2)
	   MOVE 9999 to INT-TABLE(3)
	   MOVE 9999 to INT-TABLE(4)
	   MOVE 9999 to INT-TABLE(5)
	   
	   MOVE 1111 to INT-ELEMENT(1)
	   MOVE 2222 to INT-ELEMENT(2)
	   MOVE 3333 to INT-ELEMENT(3)
	   MOVE 4444 to INT-ELEMENT(4)
	   MOVE 5555 to INT-ELEMENT(5)
	   
	   CALL "C$JAVA" USING CJAVA-CONVERTTABLETOARRAY, INT-TABLE(1), 10, 0, ARRAY-HANDLE, GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava",
	   	"CobolCallingJavaIntArray", "([I)I", INT-GROUP, FIELD-RET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava",
	   	"CobolCallingJavaIntArray", "([I)I", ARRAY-HANDLE, FIELD-RET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-CLEARARRAY, ARRAY-HANDLE GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava",
	   	"CobolCallingJavaIntArray", "([I)I", ARRAY-HANDLE, FIELD-RET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-DELETE, ARRAY-HANDLE GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "End IntArrayTest".
*	   accept omitted.
	   
*          .CharArrayTest.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "Char Array Test".
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "()V" GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CREATEARRAY, CJAVA-CHARARRAY, ARRAY-SIZE GIVING ARRAY-HANDLE.
	   
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 1, 'A', GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 3, 'B', GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 5, 'C', GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 1, FIELD-CHARRET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 2, FIELD-CHARRET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 3, FIELD-CHARRET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 4, FIELD-CHARRET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 5, FIELD-CHARRET, GIVING STATUS-VAL.
	   
	   CALL "C$JAVA"
	   	USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaCharArray", "([C)C",
	   	ARRAY-HANDLE, FIELD-CHARRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA"
	   	USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaCharArray", "([C)C",
	   	ARRAY-HANDLE, FIELD-CHARRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-CLEARARRAY, ARRAY-HANDLE GIVING STATUS-VAL.
	   
	   CALL "C$JAVA"
	   	USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaCharArray", "([C)C",
	   	ARRAY-HANDLE, FIELD-CHARRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-DELETE, ARRAY-HANDLE GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "End CharArrayTest".
	   
*          .StringArrayTest.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "String Array Test".
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "()V" GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CREATEARRAY, CJAVA-STRINGARRAY, 10 GIVING ARRAY-HANDLE.
	   
	   MOVE "00000000000000000000" TO STRING-TABLE(1)
	   MOVE "11111111111111111111" TO STRING-TABLE(2)
	   MOVE "22222222222222222222" TO STRING-TABLE(3)
	   MOVE "33333333333333333333" TO STRING-TABLE(4)
	   MOVE "44444444444444444444" TO STRING-TABLE(5)
	   MOVE "55555555555555555555" TO STRING-TABLE(6)
	   MOVE "66666666666666666666" TO STRING-TABLE(7)
	   MOVE "77777777777777777777" TO STRING-TABLE(8)
	   MOVE "88888888888888888888" TO STRING-TABLE(9)
	   MOVE "99999999999999999999" TO STRING-TABLE(10)
	   
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 1, STRING-TABLE(10), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 2, STRING-TABLE(9), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 3, STRING-TABLE(8), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 4, STRING-TABLE(7), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 5, STRING-TABLE(6), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 6, STRING-TABLE(5), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 7, STRING-TABLE(4), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 8, STRING-TABLE(3), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 9, STRING-TABLE(2), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 10, STRING-TABLE(1), GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, 
	   	"CobolCallingJava", "CobolCallingJavaStringArray", "([Ljava/lang/String;)X",
	   	ARRAY-HANDLE, FIELD-STRINGRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 1, STRING-TABLE(1), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 2, STRING-TABLE(2), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 3, STRING-TABLE(3), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 4, STRING-TABLE(4), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 5, STRING-TABLE(5), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 6, STRING-TABLE(6), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 7, STRING-TABLE(7), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 8, STRING-TABLE(8), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 9, STRING-TABLE(9), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 10, STRING-TABLE(10), GIVING STATUS-VAL.

	   MOVE "AAAAAAAAAAAAAAAAAAAA" TO STRING-TABLE(1)
	   MOVE "AAAAAAAAAAAAAAAAAAAA" TO STRING-TABLE(2)
	   MOVE "AAAAAAAAAAAAAAAAAAAA" TO STRING-TABLE(3)
	   MOVE "AAAAAAAAAAAAAAAAAAAA" TO STRING-TABLE(4)
	   MOVE "AAAAAAAAAAAAAAAAAAAA" TO STRING-TABLE(5)
	   MOVE "AAAAAAAAAAAAAAAAAAAA" TO STRING-TABLE(6)
	   MOVE "AAAAAAAAAAAAAAAAAAAA" TO STRING-TABLE(7)
	   MOVE "AAAAAAAAAAAAAAAAAAAA" TO STRING-TABLE(8)
	   MOVE "AAAAAAAAAAAAAAAAAAAA" TO STRING-TABLE(9)
	   MOVE "AAAAAAAAAAAAAAAAAAAA" TO STRING-TABLE(10)

*	   CALL "C$JAVA" USING CJAVA-CONVERTTABLETOARRAY, TABLE-NAME(1), TABLE-SIZE, ELEM-SIZE, ARRAY-HANDLE GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-CONVERTTABLETOARRAY, STRING-TABLE(1), 10, 20, ARRAY-HANDLE, GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, 
	   	"CobolCallingJava", "CobolCallingJavaStringArrayModify", "([Ljava/lang/String;)X",
	   	ARRAY-HANDLE, FIELD-STRINGRET GIVING STATUS-VAL
	   	
*	   CALL "C$JAVA" USING CJAVA-CONVERTARRAYTOTABLE, ARRAY-HANDLE, TABLE-SIZE, ELEM-SIZE, TABLE-NAME(1) GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-CONVERTARRAYTOTABLE, ARRAY_HANDLE, 10, 20, STRING-TABLE(1) GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, 
	   	"CobolCallingJava", "CobolCallingJavaStringArray", "([Ljava/lang/String;)X",
	   	ARRAY-HANDLE, FIELD-STRINGRET GIVING STATUS-VAL
	   
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-DELETE, ARRAY-HANDLE GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "End StringArrayTest".
*	   accept omitted.
	   
*          .ObjectArrayTest.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "Object Array Test".
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "()V" GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CREATEARRAY, CJAVA-OBJECTARRAY, 10 GIVING ARRAY-HANDLE.
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "java/lang/String", "(Ljava/lang/String;)V",
	   "ONE." GIVING OBJ-HANDLE-ARR(1).
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "java/lang/String", "(Ljava/lang/String;)V",
	   "TWO." GIVING OBJ-HANDLE-ARR(2).
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "java/lang/String", "(Ljava/lang/String;)V",
	   "THREE." GIVING OBJ-HANDLE-ARR(3).
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "java/lang/String", "(Ljava/lang/String;)V",
	   "FOUR." GIVING OBJ-HANDLE-ARR(4).
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "java/lang/String", "(Ljava/lang/String;)V",
	   "FIVE." GIVING OBJ-HANDLE-ARR(5).
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "java/lang/String", "(Ljava/lang/String;)V",
	   "TEN." GIVING OBJ-HANDLE-ARR(10).
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "java/lang/String", "(Ljava/lang/String;)V",
	   "NINE." GIVING OBJ-HANDLE-ARR(9).
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "java/lang/String", "(Ljava/lang/String;)V",
	   "EIGHT." GIVING OBJ-HANDLE-ARR(8).
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "java/lang/String", "(Ljava/lang/String;)V",
	   "SEVEN." GIVING OBJ-HANDLE-ARR(7).
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "java/lang/String", "(Ljava/lang/String;)V",
	   "SIX." GIVING OBJ-HANDLE-ARR(6).
	   
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 1, OBJ-HANDLE-ARR(1), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 2, OBJ-HANDLE-ARR(2), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 3, OBJ-HANDLE-ARR(3), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 4, OBJ-HANDLE-ARR(4), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 5, OBJ-HANDLE-ARR(5), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 6, OBJ-HANDLE-ARR(6), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 7, OBJ-HANDLE-ARR(7), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 8, OBJ-HANDLE-ARR(8), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 9, OBJ-HANDLE-ARR(9), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 10, OBJ-HANDLE-ARR(10), GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 1, OBJ-HANDLE-ARR(10), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 2, OBJ-HANDLE-ARR(9), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 3, OBJ-HANDLE-ARR(8), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 4, OBJ-HANDLE-ARR(7), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 5, OBJ-HANDLE-ARR(6), GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, 
	   	"CobolCallingJava", "CobolCallingJavaObjectArray", "([Ljava/lang/Object;)X",
	   	ARRAY-HANDLE, FIELD-STRINGRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 10, OBJ-HANDLE-ARR(10), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 9, OBJ-HANDLE-ARR(9), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 8, OBJ-HANDLE-ARR(8), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 7, OBJ-HANDLE-ARR(7), GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 6, OBJ-HANDLE-ARR(6), GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, 
	   	"CobolCallingJava", "CobolCallingJavaObjectArray", "([Ljava/lang/Object;)X",
	   	ARRAY-HANDLE, FIELD-STRINGRET GIVING STATUS-VAL
	   	
*	   accept omitted.
	   
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJ-HANDLE-ARR(1) GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJ-HANDLE-ARR(2) GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJ-HANDLE-ARR(3) GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJ-HANDLE-ARR(4) GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJ-HANDLE-ARR(5) GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJ-HANDLE-ARR(6) GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJ-HANDLE-ARR(7) GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJ-HANDLE-ARR(8) GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJ-HANDLE-ARR(9) GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJ-HANDLE-ARR(10) GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-DELETE, ARRAY-HANDLE GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "End ObjectArrayTest".
	   
*          .BooleanArrayTest.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "Boolean Array Test".
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "()V" GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CREATEARRAY, CJAVA-BOOLEANARRAY, ARRAY-SIZE GIVING ARRAY-HANDLE.
	   
*	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, ARRAY-INDEX, ARRAY-VALUE, GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 1, 1, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 3, 1, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 5, 1, GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 1, FIELD-BOOLRET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 2, FIELD-BOOLRET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 3, FIELD-BOOLRET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 4, FIELD-BOOLRET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 5, FIELD-BOOLRET, GIVING STATUS-VAL.
*	   accept omitted.
	   
*	   CALL "C$JAVA" USING CJAVA-CONVERTTABLETOARRAY, ARRAY-HANDLE, TABLE-VAR, GIVING STATUS-VAL.
*	   CALL "C$JAVA" USING CJAVA-CONVERTARRAYTOTABLE, ARRAY-HANDLE, TABLE-VAR, GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaBooleanArray", "([Z)Z",
	   	ARRAY-HANDLE, FIELD-BOOLRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaBooleanArray", "([Z)Z",
	   	ARRAY-HANDLE, FIELD-BOOLRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-CLEARARRAY, ARRAY-HANDLE GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaBooleanArray", "([Z)Z",
	   	ARRAY-HANDLE, FIELD-BOOLRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-DESTROYARRAY, ARRAY-HANDLE GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "End BooleanArrayTest".

*          .ByteArrayTest.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "Byte Array Test".
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "()V" GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CREATEARRAY, CJAVA-BYTEARRAY, ARRAY-SIZE GIVING ARRAY-HANDLE.
	   
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 1, 'D', GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 3, 'E', GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 5, 'F', GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 1, FIELD-BYTERET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 2, FIELD-BYTERET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 3, FIELD-BYTERET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 4, FIELD-BYTERET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 5, FIELD-BYTERET, GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaByteArray", "([B)B",
	   	ARRAY-HANDLE, FIELD-BYTERET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaByteArray", "([B)B",
	   	ARRAY-HANDLE, FIELD-BYTERET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-CLEARARRAY, ARRAY-HANDLE GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaByteArray", "([B)B",
	   	ARRAY-HANDLE, FIELD-BYTERET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-DELETE, ARRAY-HANDLE GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "End ByteArrayTest".

*          .ShortArrayTest.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "Short Array Test".
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "()V" GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CREATEARRAY, CJAVA-SHORTARRAY, ARRAY-SIZE GIVING ARRAY-HANDLE.
	   
	   MOVE 111 to FIELD-SHORT
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 1, FIELD-SHORT, GIVING STATUS-VAL.
	   MOVE 222 to FIELD-SHORT
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 3, FIELD-SHORT, GIVING STATUS-VAL.
	   MOVE 333 to FIELD-SHORT
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 5, FIELD-SHORT, GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 1, FIELD-SHORTRET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 2, FIELD-SHORTRET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 3, FIELD-SHORTRET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 4, FIELD-SHORTRET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 5, FIELD-SHORTRET, GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaShortArray", "([S)S",
	   	ARRAY-HANDLE, FIELD-SHORTRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaShortArray", "([S)S",
	   	ARRAY-HANDLE, FIELD-SHORTRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-CLEARARRAY, ARRAY-HANDLE GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaShortArray", "([S)S",
	   	ARRAY-HANDLE, FIELD-SHORTRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-DELETE, ARRAY-HANDLE GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "End ShortArrayTest".

*          .LongArrayTest.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "Long Array Test".
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "()V" GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CREATEARRAY, CJAVA-LONGARRAY, ARRAY-SIZE GIVING ARRAY-HANDLE.
	   
	   MOVE 111111 to FIELD-LONG.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 1, FIELD-LONG, GIVING STATUS-VAL.
	   MOVE 222222 to FIELD-LONG.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 3, FIELD-LONG, GIVING STATUS-VAL.
	   MOVE 333333 to FIELD-LONG.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 5, FIELD-LONG, GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 1, FIELD-LONGRET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 2, FIELD-LONGRET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 3, FIELD-LONGRET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 4, FIELD-LONGRET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 5, FIELD-LONGRET, GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaLongArray", "([J)J",
	   	ARRAY-HANDLE, FIELD-LONGRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaLongArray", "([J)J",
	   	ARRAY-HANDLE, FIELD-LONGRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-CLEARARRAY, ARRAY-HANDLE GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaLongArray", "([J)J",
	   	ARRAY-HANDLE, FIELD-LONGRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-DELETE, ARRAY-HANDLE GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "End LongArrayTest".
	   
*          .FloatArrayTest.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "Float Array Test".
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "()V" GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CREATEARRAY, CJAVA-FLOATARRAY, ARRAY-SIZE GIVING ARRAY-HANDLE.
	   
	   MOVE 11.11 to FIELD-FLOAT.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 1, FIELD-FLOAT, GIVING STATUS-VAL.
	   MOVE 22.22 to FIELD-FLOAT.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 3, FIELD-FLOAT, GIVING STATUS-VAL.
	   MOVE 33.33 to FIELD-FLOAT.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 5, FIELD-FLOAT, GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 1, FIELD-FLOATRET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 2, FIELD-FLOATRET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 3, FIELD-FLOATRET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 4, FIELD-FLOATRET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 5, FIELD-FLOATRET, GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaFloatArray", "([F)F",
	   	ARRAY-HANDLE, FIELD-FLOATRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaFloatArray", "([F)F",
	   	ARRAY-HANDLE, FIELD-FLOATRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-CLEARARRAY, ARRAY-HANDLE GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaFloatArray", "([F)F",
	   	ARRAY-HANDLE, FIELD-FLOATRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-DELETE, ARRAY-HANDLE GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "End FloatArrayTest".
	   
*          .DoubleArrayTest.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "Double Array Test".
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "()V" GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CREATEARRAY, CJAVA-DOUBLEARRAY, ARRAY-SIZE GIVING ARRAY-HANDLE.
	   
	   MOVE 111.111 to FIELD-DOUBLE.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 1, FIELD-DOUBLE, GIVING STATUS-VAL.
	   MOVE 222.222 to FIELD-DOUBLE.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 3, FIELD-DOUBLE, GIVING STATUS-VAL.
	   MOVE 333.333 to FIELD-DOUBLE.
	   CALL "C$JAVA" USING CJAVA-SETARRAYELEMENT, ARRAY-HANDLE, 5, FIELD-DOUBLE, GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 1, FIELD-DOUBLERET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 2, FIELD-DOUBLERET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 3, FIELD-DOUBLERET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 4, FIELD-DOUBLERET, GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-GETARRAYELEMENT, ARRAY-HANDLE, 5, FIELD-DOUBLERET, GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaDoubleArray", "([D)D",
	   	ARRAY-HANDLE, FIELD-DOUBLERET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaDoubleArray", "([D)D",
	   	ARRAY-HANDLE, FIELD-DOUBLERET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-CLEARARRAY, ARRAY-HANDLE GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaDoubleArray", "([D)D",
	   	ARRAY-HANDLE, FIELD-DOUBLERET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-DELETE, ARRAY-HANDLE GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "End DoubleArrayTest".
	   
*	   .TestDefaultCall.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, " ".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "******************************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "** Default Call **************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "******************************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "******************************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, " ".
	   
*          .TestCharDefault.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "TestCharDefault".
	   
	   move 'a' to FIELD-CHAR
	   move 'Z' to FIELD-CHARRET
	   
	   CALL "C$JAVA" USING "CobolCallingJava", "CobolCallingJavaChar", "(C)C",
	   	FIELD-CHAR, FIELD-CHARRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaChar (C)C".

*          .TestStringDefault.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "TestStringDefault".
	   
	   move "string start one" to FIELD-STRING
	   move "string start two" to FIELD-STRINGRET
	   
	   STRING FIELD-STRING INTO LOGMSG END-STRING
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, LOGMSG GIVING STATUS-VAL.
	   
	   STRING FIELD-STRINGRET INTO LOGMSG END-STRING
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, LOGMSG GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING "CobolCallingJava", "CobolCallingJavaString", "(Ljava/lang/String;)Ljava/lang/String;",
	   	FIELD-STRING, FIELD-STRINGRET GIVING STATUS-VAL

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaString (X)X".
	   
*    	   .TestIntDefault.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "TestIntDefault".
	   
	   move 24 to FIELD-INT.
	   move 25 to FIELD-RET.
	   
	   CALL "C$JAVA" USING "CobolCallingJava", "CobolCallingJavaInt", "(I)I",
	   	FIELD-INT, FIELD-RET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaInt (I)I".
	   
*          .TestBooleanDefault.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "TestBooleanDefault".
	   
	   move 1 to FIELD-BOOL
	   move 1 to FIELD-BOOLRET
	   
	   CALL "C$JAVA" USING "CobolCallingJava", "CobolCallingJavaBoolean", "(Z)Z",
	   	FIELD-BOOL, FIELD-BOOLRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaBoolean (Z)Z".
	   
*          .TestVoidDefault.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "TestVoidDefault".
	   
	   CALL "C$JAVA" USING "CobolCallingJava", "CobolCallingJavaVoid", "()V" GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaVoid ()V".
	   
*      	   accept omitted.
	   
*          .TestLongDefault.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "TestLongDefault".
	   
	   move 222222222222222222 to FIELD-LONG
	   move 225 to FIELD-LONGRET
	   
	   CALL "C$JAVA" USING "CobolCallingJava", "CobolCallingJavaLong", "(J)J", FIELD-LONG, FIELD-LONGRET
	   	GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaLong (J)J".
	   
*          .TestDoubleDefault.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "TestDoubleDefault".
	   
	   move 1.555 to FIELD-DOUBLE
	   move 1.666 to FIELD-DOUBLERET
	   
	   CALL "C$JAVA" USING "CobolCallingJava", "CobolCallingJavaDouble", "(D)D",
	   	FIELD-DOUBLE, FIELD-DOUBLERET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaDouble (D)D".
	   
*          .TestFloatDefault.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "TestFloatDefault".
	   
	   move 1.777 to FIELD-FLOAT
	   move 1.888 to FIELD-FLOATRET
	   
	   CALL "C$JAVA" USING "CobolCallingJava", "CobolCallingJavaFloat", "(F)F",
	   	FIELD-FLOAT, FIELD-FLOATRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaFloat (F)F".
	   
*          .TestShortDefault.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "TestShortDefault".
	   
	   move 1 to FIELD-SHORT
	   move 1 to FIELD-SHORTRET
	   
	   CALL "C$JAVA" USING "CobolCallingJava", "CobolCallingJavaShort", "(S)S",
	   	FIELD-SHORT, FIELD-SHORTRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaShort (S)S".
	   
*          .TestByteDefault.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "TestByteDefault".
	   
	   move 1 to FIELD-BYTE
	   move 1 to FIELD-BYTERET
	   
	   CALL "C$JAVA" USING "CobolCallingJava", "CobolCallingJavaByte", "(B)B",
	        FIELD-BYTE, FIELD-BYTERET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaByte (B)B".
	   
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, " ".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "******************************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "** Virtural Call *************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "******************************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "******************************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, " ".
	   
*          .TestCharV.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "test charV".
	   
	   move 'a' to FIELD-CHAR
	   move 'Z' to FIELD-CHARRET
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "(C)V", FIELD-CHAR GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaCharV", "(C)C",
	   	FIELD-CHAR, FIELD-CHARRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaCharV (C)C".

*          .TestStringV.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "test stringV".
	   
	   move "string start one" to FIELD-STRING
	   move "string start two" to FIELD-STRINGRET
	   
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, FIELD-STRING GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, FIELD-STRINGRET GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "(X)V", FIELD-STRING GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaStringV", "(X)X",
	   	FIELD-STRING, FIELD-STRINGRET GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaStringV (X)X".
	   
*          .TestIntV.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "test integerV".
	   
	   move 24 to FIELD-INT.
	   move 25 to FIELD-RET.
	   
	   CALL "C$JAVA"
	   	USING CJAVA-NEW, "CobolCallingJava", "(I)V", FIELD-INT GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaIntV", "(I)I",
	   	FIELD-INT, FIELD-RET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaIntV (I)I".
	   
*          .TestBooleanV.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "test booleanV".
	   
	   move 1 to FIELD-BOOL
	   move 1 to FIELD-BOOLRET
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "(Z)V", FIELD-BOOL GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaBooleanV", "(Z)Z",
	   	FIELD-BOOL, FIELD-BOOLRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaBooleanV (Z)Z".
	   
*          .TestVoidV.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "test voidV".
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "()V" GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaVoidV", "()V"
	   	GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaVoidV ()V".
	   
*          .TestLongV.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "test longV".
	   
	   move 222222222222222222 to FIELD-LONG
	   move 225 to FIELD-LONGRET
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "(J)V", FIELD-LONG GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaLongV", "(J)J",
	   	FIELD-LONG, FIELD-LONGRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaLongV (J)J".
	   
*          .TestDoubleV.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "test doubleV".
	   
	   move 1.555 to FIELD-DOUBLE
	   move 1.666 to FIELD-DOUBLERET
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "(D)V", FIELD-DOUBLERET GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaDoubleV", "(D)D",
	   	FIELD-DOUBLE, FIELD-DOUBLERET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaDoubleV (D)D".
	   
*          .TestFloatV.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "test floatV".
	   
	   move 1.777 to FIELD-FLOAT
	   move 1.888 to FIELD-FLOATRET
	   
	   CALL "C$JAVA"
	   	USING CJAVA-NEW, "CobolCallingJava", "(F)V", FIELD-FLOATRET GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaFloatV", "(F)F",
	   	FIELD-FLOAT, FIELD-FLOATRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaFloatV (F)F".
	   
*          .TestShortV.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "test shortV".
	   
	   move 1 to FIELD-SHORT
	   move 1 to FIELD-SHORTRET
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "(S)V", FIELD-SHORTRET GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaShortV", "(S)S",
	   	FIELD-SHORT, FIELD-SHORTRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaShortV (S)S".
	   
*          .TestByteV.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "test byteV".
	   
	   move 1 to FIELD-BYTE
	   move 1 to FIELD-BYTERET
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "(B)V", FIELD-BYTERET GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaByteV", "(B)B",
	   	FIELD-BYTE, FIELD-BYTERET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaByteV (B)B".
	   
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, " ".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "******************************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "** Static Call ***************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "******************************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "******************************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, " ".
	   
*          .TestCharStatic.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "TestCharStatic".
	   
	   move 'a' to FIELD-CHAR
	   move 'Z' to FIELD-CHARRET
	   
	   CALL "C$JAVA" USING CJAVA-CALLSTATIC, "CobolCallingJava", "CobolCallingJavaChar", "(C)C",
	   	FIELD-CHAR, FIELD-CHARRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CallStatic CobolCallingJavaChar (C)C".

*          .TestStringStatic.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "TestStringStatic".
	   
	   move "string start one" to FIELD-STRING
	   move "string start two" to FIELD-STRINGRET
	   
	   STRING FIELD-STRING INTO LOGMSG END-STRING
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, LOGMSG GIVING STATUS-VAL.
	   
	   STRING FIELD-STRINGRET INTO LOGMSG END-STRING
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, LOGMSG GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-CALLSTATIC, "CobolCallingJava", "CobolCallingJavaString", "(Ljava/lang/String;)Ljava/lang/String;",
	   	FIELD-STRING, FIELD-STRINGRET GIVING STATUS-VAL

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CallStatic CobolCallingJavaString (X)X".
	   
*          .TestIntStatic.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "TestIntStatic".
	   
	   move 24 to FIELD-INT.
	   move 25 to FIELD-RET.
	   
	   CALL "C$JAVA" USING CJAVA-CALLSTATIC, "CobolCallingJava", "CobolCallingJavaInt", "(I)I", FIELD-INT, FIELD-RET
	   	GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CallStatic CobolCallingJavaInt (I)I".
	   
*          .TestBooleanStatic.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "TestBooleanStatic".
	   
	   move 1 to FIELD-BOOL
	   move 1 to FIELD-BOOLRET
	   
	   CALL "C$JAVA" USING CJAVA-CALLSTATIC, "CobolCallingJava", "CobolCallingJavaBoolean", "(Z)Z",
	   	FIELD-BOOL, FIELD-BOOLRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CallStatic CobolCallingJavaBoolean (Z)Z".
	   
*          .TestVoidStatic.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "TestVoidStatic".
	   
	   CALL "C$JAVA" USING CJAVA-CALLSTATIC, "CobolCallingJava", "CobolCallingJavaVoid", "()V"
	   	GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CallStatic CobolCallingJavaVoid ()V".
	   
*          .TestLongStatic.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "TestLongStatic".
	   
	   move 222222222222222222 to FIELD-LONG
	   move 225 to FIELD-LONGRET
	   
	   CALL "C$JAVA" USING CJAVA-CALLSTATIC, "CobolCallingJava", "CobolCallingJavaLong", "(J)J",
	   	FIELD-LONG, FIELD-LONGRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CallStatic CobolCallingJavaLong (J)J".
	   
*          .TestDoubleStatic.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "TestDoubleStatic".
	   
	   move 1.555 to FIELD-DOUBLE
	   move 1.666 to FIELD-DOUBLERET
	   
	   CALL "C$JAVA" USING CJAVA-CALLSTATIC, "CobolCallingJava", "CobolCallingJavaDouble", "(D)D",
	   	FIELD-DOUBLE, FIELD-DOUBLERET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CallStatic CobolCallingJavaDouble (D)D".
	   
*          .TestFloatStatic.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "TestFloatStatic".
	   
	   move 1.777 to FIELD-FLOAT
	   move 1.888 to FIELD-FLOATRET
	   
	   CALL "C$JAVA" USING CJAVA-CALLSTATIC, "CobolCallingJava", "CobolCallingJavaFloat", "(F)F",
	   	FIELD-FLOAT, FIELD-FLOATRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CallStatic CobolCallingJavaFloat (F)F".
	   
*          .TestShortStatic.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "TestShortStatic".
	   
	   move 1 to FIELD-SHORT
	   move 1 to FIELD-SHORTRET
	   
	   CALL "C$JAVA" USING CJAVA-CALLSTATIC, "CobolCallingJava", "CobolCallingJavaShort", "(S)S",
	   	FIELD-SHORT, FIELD-SHORTRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CallStatic CobolCallingJavaShort (S)S".
	   
*          .TestByteStatic.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "TestByteStatic".
	   
	   move 1 to FIELD-BYTE
	   move 1 to FIELD-BYTERET
	   
	   CALL "C$JAVA" USING CJAVA-CALLSTATIC, "CobolCallingJava", "CobolCallingJavaByte", "(B)B",
	   	FIELD-BYTE, FIELD-BYTERET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CallStatic CobolCallingJavaByte (B)B".
	   
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, " ".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "******************************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "** Non-Virtural Call *********************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "******************************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "******************************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, " ".
	   
*          .TestCharNV.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "test charNV".
	   
	   move 'a' to FIELD-CHAR
	   move 'Z' to FIELD-CHARRET
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "(C)V", FIELD-CHAR GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaCharNV", "(C)C",
	   	FIELD-CHAR, FIELD-CHARRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaCharNV (C)C".

*          .TestStringNV.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "test stringNV".
	   
	   move "string start one" to FIELD-STRING
	   move "string start two" to FIELD-STRINGRET
	   
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, FIELD-STRING GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, FIELD-STRINGRET GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "(X)V", FIELD-STRING GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaStringNV", "(X)X",
	   	FIELD-STRING, FIELD-STRINGRET GIVING STATUS-VAL.
	   
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaStringNV (X)X".
	   
*          .TestIntNV.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "test integerNV".
	   
	   move 24 to FIELD-INT.
	   move 25 to FIELD-RET.
	   
	   CALL "C$JAVA"
	   	USING CJAVA-NEW, "CobolCallingJava", "(I)V", FIELD-INT GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaIntNV", "(I)I",
	   	FIELD-INT, FIELD-RET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaIntNV (I)I".
	   
*          .TestBooleanNV.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "test booleanNV".
	   
	   move 1 to FIELD-BOOL
	   move 1 to FIELD-BOOLRET
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "(Z)V", FIELD-BOOL GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaBooleanNV", "(Z)Z",
	   	FIELD-BOOL, FIELD-BOOLRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaBooleanNV (Z)Z".
	   
*          .TestVoidNV.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "test voidNV".
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "()V" GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaVoidNV", "()V"
	   	GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaVoidNV ()V".
	   
*          .TestLongNV.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "test longNV".
	   
	   move 222222222222222222 to FIELD-LONG
	   move 225 to FIELD-LONGRET
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "(J)V", FIELD-LONG GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaLongNV", "(J)J",
	   	FIELD-LONG, FIELD-LONGRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaLongNV (J)J".
	   
*          .TestDoubleNV.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "test doubleNV".
	   
	   move 1.555 to FIELD-DOUBLE
	   move 1.666 to FIELD-DOUBLERET
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "(D)V", FIELD-DOUBLERET GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaDoubleNV", "(D)D",
	   	FIELD-DOUBLE, FIELD-DOUBLERET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaDoubleNV (D)D".
	   
*          .TestFloatNV.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "test floatNV".
	   
	   move 1.777 to FIELD-FLOAT
	   move 1.888 to FIELD-FLOATRET
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "(F)V", FIELD-FLOATRET GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaFloatNV", "(F)F",
	   	FIELD-FLOAT, FIELD-FLOATRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaFloatNV (F)F".
	   
*          .TestShortNV.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "test shortNV".
	   
	   move 1 to FIELD-SHORT
	   move 1 to FIELD-SHORTRET
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "(S)V", FIELD-SHORTRET GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaShortNV", "(S)S",
	   	FIELD-SHORT, FIELD-SHORTRET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaShortNV (S)S".
	   
*          .TestByteNV.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "test byteNV".
	   
	   move 1 to FIELD-BYTE
	   move 1 to FIELD-BYTERET
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "(B)V", FIELD-BYTERET GIVING OBJECT-HANDLE.

	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaByteNV", "(B)B",
	   	FIELD-BYTE, FIELD-BYTERET GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.

	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaByteNV (B)B".
	   
*          .ReentrantTest.
      
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, " ".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "******************************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "** Reentrant Test - J2C2J2C **************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "******************************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "******************************************".
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, " ".
	   
	   CALL "C$JAVA" USING CJAVA-NEW, "CobolCallingJava", "()V" GIVING OBJECT-HANDLE.
	   
	   CALL "C$JAVA" USING CJAVA-CALL, OBJECT-HANDLE, "CobolCallingJava", "CobolCallingJavaReentrantTest", "()V",
	   	GIVING STATUS-VAL
	   	
	   CALL "C$JAVA" USING CJAVA-DELETE, OBJECT-HANDLE GIVING STATUS-VAL.
	   CALL "C$JAVA" USING CJAVA-LOGMESSAGE, "CobolCallingJavaReentrantTest ()V".
	   
*	   scroll up 46.
*	   accept omitted.
	   