       FD  CADEMP  LABEL RECORD IS STANDARD.

       01  DEMP-REGISTR-1.
           03 DEMP-RECORDK-1.
               05 DEMP-CODEMP-1          PIC  9(03).
           03  DEMP-NOMEEMP-1             PIC  X(10).


