       IDENTIFICATION  DIVISION.
       PROGRAM-ID.     DESCONTO03.
       ENVIRONMENT     DIVISION.
       CONFIGURATION   SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WORK-GERAL.
           03  W-OPCAO            PIC  9(01).
	   03  PRECO              PIC 9(006)V99.
           03  PERDESC            PIC 9(003)V99.
           03  PERCOMS            PIC 9(003)V99.
           03  VALORD             PIC 9(006)V99.
           03  VALORD-F           PIC ZZZ.ZZ9,99.
           03  PRECO-LIQ          PIC ZZZ.ZZ9,99.
           03  VALCMS             PIC 9(003)V99.
           03  VALCMS-F           PIC 9(003)V99.
           03  TABELA             PIC 9(001).
           03  IND                PIC 9(002).
           03  TABDESC OCCURS 10 TIMES.            
                05 DESCONTO PIC 9(003)V99.
                05 COMISSAO PIC 9(003)V99.    
              
	
       PROCEDURE DIVISION.
       INICIO.
	INITIALIZE WORK-GERAL.
           DISPLAY WINDOW AT 0101 LINES 20 SIZE 50
                                  BACKGROUND-COLOR 7
                                  FOREGROUND-COLOR 1
                                  ERASE
              
              MOVE 5 TO PERDESC.
              MOVE 20 TO PERCOMS.
              PERFORM VARYING IND FROM 1 BY 1 UNTIL 1 > 10
                 MOVE PERDESC TO DESCONTO(IND)
                 MOVE PERCOMS TO COMISSAO(IND)

                 SUBTRACT 2 FROM PERCOMS
                 ADD 5 TO PERDESC 
              END-PERFORM.
                          
              PERFORM TEST AFTER UNTIL W-OPCAO = 0
              DISPLAY "1 = CALCULAR" AT LINE 02 COLUMN 05
              DISPLAY "OPCAO :         (0=finalizar)" AT 0705
              ACCEPT W-OPCAO AT 0713 WITH UPDATE
              EVALUATE W-OPCAO
                 WHEN 0
                      CONTINUE
                 WHEN 1
                 DISPLAY "INFORME O PRECO: " AT 1005
                 DISPLAY "INFORME A TABELA: " AT 1105				
		 ACCEPT PRECO AT 1030 WITH UPDATE
		 ACCEPT TABELA AT 1130 WITH UPDATE
		 IF TABELA < 1 OR > 5  
                    DISPLAY "TABELA INVALIDO" AT 1705
                 ELSE 
                     PERFORM CACLULA-TABELA

                     COMPUTE VALORD ROUNDED = PRECO * PERDESC / 100
                     
                     MOVE VALORD TO VALORD-F 
                     DISPLAY "PRECO LIQUIDO" AT 1605
                     DISPLAY PRECO-LIQ AT 1630

                     COMPUTE PRECO-LIQ ROUNDED = PRECO - VALORD
                     DISPLAY "PRECO LIQUIDO" AT 1605
                     DISPLAY PRECO-LIQ AT 1630
                       
                      COMPUTE VALCMS ROUNDED = PRECO-LIQ *
                                               PERCOMS / 100
                      MOVE VALCMS TO VALCMS-F
                      DISPLAY "VALOR DA COMISSAO" AT 1705
                      
                      END-IF
		WHEN OTHER
                DISPLAY "OPCAO INVALIDA" AT 1005
              
		END-EVALUATE
           END-PERFORM.


           EXIT PROGRAM.
           STOP RUN.

       CACLULA-TABELA.
              PERFORM VARYING IND FROM 1 BY 1 UNTIL IND > 10
               IF IND = TABELA
                 MOVE DESCONTO(IND) TO PERDESC
                 MOVE COMISSAO(IND) TO PERCOMS
                  END-IF
                 END-PERFORM.