       IDENTIFICATION  DIVISION.
       PROGRAM-ID.     PRG01.
       ENVIRONMENT     DIVISION.
       CONFIGURATION   SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  SMALL-FONT                     HANDLE.

       01  WORK-GERAL.
           03  RESULTADO          PIC  9(02).
           03  RESULT1            PIC  9(02).
           03  RESULT2            PIC  9(02).
           03  RESULTADO2         PIC  9(04).
           03  RESTO              PIC  9(04).
           03  VALOR              PIC  9(09)V99.
           03  VALRESULT          PIC  9(09)V99.
           03  VALOR-EDITADO      PIC  ZZZ.ZZZ.ZZ9,99-.

           03  X-1                PIC  X(01).
           03  WLIN               PIC  9(02).
           03  WCOL               PIC  9(02).
           
           03  W-DETALHE          PIC  X(256).
       
       01  CAMPOS-CONTROLE-TELA-GRAFICA.
           03  EVENT-STATUS IS SPECIAL-NAMES EVENT STATUS.
               05 EVENT-TYPE              PIC X(4) COMP-X.
                  88 CA-CMD-CLOSE         VALUE 1.
                  88 CA-CMD-TABCHANGED    VALUE 7.
               05 EVENT-WINDOW-HANDLE     HANDLE OF WINDOW.
               05 EVENT-CONTROL-HANDLE    HANDLE.
               05 EVENT-CONTROL-ID        PIC XX COMP-X.
               05 EVENT-DATA-1            SIGNED-SHORT.
               05 EVENT-DATA-2            SIGNED-LONG.
               05 EVENT-ACTION            PIC X COMP-X.

           03  TECLA-ESCAPE IS SPECIAL-NAMES CRT STATUS
                                          PIC 9(4) VALUE 0.
               88 TECLOU-ESC              VALUE 27.

       01  JANELA-PRINCIPAL               PIC X(10) EXTERNAL.

       SCREEN SECTION.
       01  TELA-PRINCIPAL.
           03 LST-BOX-RESULTADOS LIST-BOX
                       LINE 02
                       COL 02
                       SIZE 70
                       LINES 27
                       3-D
                       ID 1
                       FONT SMALL-FONT
                       UNSORTED.

       PROCEDURE DIVISION.
       INICIO.
           ACCEPT SMALL-FONT FROM STANDARD OBJECT "SMALL-FONT".

           DISPLAY INITIAL WINDOW
               TITLE "PRG01"
               LINES 26
               SIZE 57,25
               COLOR 257
               SYSTEM MENU
               AUTO-MINIMIZE
               BACKGROUND-LOW
               FONT SMALL-FONT
               POP-UP AREA JANELA-PRINCIPAL.

           DISPLAY TELA-PRINCIPAL.

           MOVE 10 TO RESULTADO

           MOVE SPACES TO W-DETALHE
           STRING 'RESULTADO = ' RESULTADO
              DELIMITED SIZE INTO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           |*

           DIVIDE 2 INTO RESULTADO

           MOVE 'DIVIDE 2 INTO RESULTADO : ' TO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           MOVE SPACES TO W-DETALHE
           STRING '   RESULTADO = ' RESULTADO
              DELIMITED SIZE INTO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           |*

           MOVE ALL '-' TO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE

           MOVE 10 TO RESULT1
           MOVE 20 TO RESULT2

           MOVE SPACES TO W-DETALHE
           STRING 'RESULT1 = ' RESULT1
              DELIMITED SIZE INTO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           MOVE SPACES TO W-DETALHE
           STRING 'RESULT2 = ' RESULT2
              DELIMITED SIZE INTO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           MOVE 'DIVIDE 2 INTO RESULT1, RESULT2 :' TO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           DIVIDE 2 INTO RESULT1, RESULT2

           MOVE SPACES TO W-DETALHE
           STRING '   RESULT1 = ' RESULT1
              DELIMITED SIZE INTO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           MOVE SPACES TO W-DETALHE
           STRING '   RESULT2 = ' RESULT2
              DELIMITED SIZE INTO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           |*

           MOVE ALL '-' TO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE

           MOVE 100,50 TO VALOR
           MOVE VALOR TO VALOR-EDITADO
           CALL 'C$JUSTIFY' USING VALOR-EDITADO, 'L'

           MOVE SPACES TO W-DETALHE
           STRING 'VALOR = ' VALOR-EDITADO
              DELIMITED SIZE INTO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           MOVE 'DIVIDE 2 INTO VALOR GIVING VALRESULT :' TO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           DIVIDE 2 INTO VALOR GIVING VALRESULT

           MOVE VALOR TO VALOR-EDITADO
           CALL 'C$JUSTIFY' USING VALOR-EDITADO, 'L'

           MOVE SPACES TO W-DETALHE
           STRING '   VALOR = ' VALOR-EDITADO
              DELIMITED SIZE INTO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           MOVE VALRESULT TO VALOR-EDITADO
           CALL 'C$JUSTIFY' USING VALOR-EDITADO, 'L'

           MOVE SPACES TO W-DETALHE
           STRING '   VALRESULT = ' VALOR-EDITADO
              DELIMITED SIZE INTO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           |*

           MOVE ALL '-' TO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE

           MOVE 100,50 TO VALOR
           MOVE VALOR TO VALOR-EDITADO
           CALL 'C$JUSTIFY' USING VALOR-EDITADO, 'L'

           MOVE SPACES TO W-DETALHE
           STRING 'VALOR = ' VALOR-EDITADO
              DELIMITED SIZE INTO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           MOVE 'DIVIDE VALOR BY 2 GIVING VALRESULT :' TO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           DIVIDE VALOR BY 2 GIVING VALRESULT

           MOVE VALOR TO VALOR-EDITADO
           CALL 'C$JUSTIFY' USING VALOR-EDITADO, 'L'
           MOVE SPACES TO W-DETALHE
           STRING '   VALOR = ' VALOR-EDITADO
              DELIMITED SIZE INTO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           MOVE VALRESULT TO VALOR-EDITADO
           CALL 'C$JUSTIFY' USING VALOR-EDITADO, 'L'
           MOVE SPACES TO W-DETALHE
           STRING '   VALRESULT = ' VALOR-EDITADO
              DELIMITED SIZE INTO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           |*

           MOVE ALL '-' TO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE

           DIVIDE 4 INTO 2009 GIVING RESULTADO2 REMAINDER RESTO

           MOVE 'DIVIDE 4 INTO 2009 GIVING RESULTADO2 REMAINDER RESTO :'
                TO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           MOVE SPACES TO W-DETALHE
           STRING '   RESULTADO2 = ' RESULTADO2
              DELIMITED SIZE INTO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           MOVE SPACES TO W-DETALHE
           STRING '   RESTO = ' RESTO
              DELIMITED SIZE INTO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           |*

           MOVE ALL '-' TO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE

           DIVIDE 2009 BY 4 GIVING RESULTADO2 REMAINDER RESTO

           MOVE 'DIVIDE 2009 BY 4 GIVING RESULTADO2 REMAINDER RESTO :'
                TO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           MOVE SPACES TO W-DETALHE
           STRING '   RESULTADO2 = ' RESULTADO2
              DELIMITED SIZE INTO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           MOVE SPACES TO W-DETALHE
           STRING '   RESTO = ' RESTO
              DELIMITED SIZE INTO W-DETALHE
           MODIFY LST-BOX-RESULTADOS, ITEM-TO-ADD = W-DETALHE.

           |*

           ACCEPT X-1

           CLOSE WINDOW JANELA-PRINCIPAL.
           EXIT PROGRAM.
           STOP RUN.
