IDENTIFICATION  DIVISION.
PROGRAM-ID.     PRG03.
ENVIRONMENT     DIVISION.
CONFIGURATION   SECTION.
SPECIAL-NAMES.
    DECIMAL-POINT IS COMMA.
DATA  DIVISION.
WORKING-STORAGE SECTION.
01  WS-TELA                PIC X(10).
01  WS-TELA-2              PIC X(10).
01  SAVE-CURSOR-MODE       PIC 9(1).

01  SCREEN-CONTROL.
    03  ACCEPT-CONTROL     PIC 9.
    03  CONTROL-VALUE      PIC 999.

01  WORK-GERAL.
    03  KEY-OPCAO          PIC X(02).
    03  TEMPO-OUT          PIC 9(09) VALUE 999999999.
    03  KEY-ESC            PIC 9(03) VALUE 0.
    03  VALOR              PIC S9(05)V99.
    03  VALOR-EDITADO      PIC 999999999999999999-.

    03  VALOR-1            PIC  X(19)      VALUE ' '.
    03  VALOR-2            PIC  X(19)      VALUE ' '.
    03  OPERACAO           PIC  X(2).
    03  SN                 PIC  X. 

COPY "SA3MATH.CPY".

PROCEDURE DIVISION.
INICIO.

    DISPLAY SPACES ERASE SCREEN.

    DISPLAY "VALOR-1   :" AT 0201
    DISPLAY "OPERACAO  :" AT 0301
    DISPLAY "VALOR-2   :" AT 0401
    DISPLAY "RESULTADO :" AT 0601
    DISPLAY "INTEIRAS  :" AT 0701
    DISPLAY "EDITADO   :" AT 0901

    PERFORM WITH TEST AFTER UNTIL 1 = 2
       ACCEPT  VALOR-1  AT 0213 WITH UPDATE
       IF VALOR-1 = SPACES
          EXIT PERFORM
       END-IF
       ACCEPT  OPERACAO AT 0313 WITH UPDATE
       ACCEPT  VALOR-2  AT 0413 WITH UPDATE

       IF SPACES = OPERACAO AND VALOR-2
          CALL "SA3MATH" USING VALOR-1
       ELSE
          CALL "SA3MATH" USING VALOR-1, OPERACAO, VALOR-2
       END-IF
       CANCEL 'SA3MATH'
       
       MOVE SA3MATH-RESULTADO TO VALOR-EDITADO
       
       DISPLAY VALOR-EDITADO AT 0613
       DISPLAY SA3MATH-INTEIRAS AT 0713

       DISPLAY SA3MATH-RES-EDIT AT 0913
       
    END-PERFORM.

    EXIT PROGRAM.
    STOP RUN.
