       FD  CFROTA  LABEL RECORD IS STANDARD.

       01  FRO-REG-1.
           03  FRO-ID         PIC 9(03).
           03  FRO-ORI        PIC 9(03).
           03  FRO-DES        PIC 9(03).
           03  FRO-DESC       PIC X(60).
	   03  FRO-CON        PIC 9(5)V99.
	   03  FRO-SUB        PIC 9(5)V99.
	   03  FRO-QTD        PIC 9(1).
