       FD  CCIDADE  LABEL RECORD IS STANDARD.

       01  CID-REG-1.
           03  CID-ID         PIC 9(3).
           03  CID-NOME       PIC X(60).
           03  CID-LOC        PIC 9(4).