       FD  CCLIENTE  LABEL RECORD IS STANDARD.

       01  CLI-REG-1.
           03  CLI-CPF        PIC 9(11).
           03  CLI-NOME       PIC X(60).
           03  CLI-END        PIC X(100).
           03  CLI-TEL        PIC 9(10).
	   03  CLI-COM        PIC 9(4).
	   03  CLI-DESC       PIC 9(4).