       01  SA3MATH-EXTERNAL-FIELDS  EXTERNAL.
           03 SA3MATH-RESULTADO                    PIC S9(18).
           03 SA3MATH-INTEIRAS                     PIC  9(02). 
           03 SA3MATH-DECIMAIS                     PIC  9(02). 
           03 SA3MATH-RES-EDIT                     PIC  X(20).
